asciiart-load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    apdex: {}
    ensure: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
  defaults:
    headers:
      Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MjEsInJvbGUiOiJhZG1pbiIsImlhdCI6MTcyNDYwMTQ1NSwiZXhwIjoxNzI1MjA2MjU1fQ.ygNOYv9Rxe5TUmPxLPDT8CNqWgNlJ669wt1B_dPz_TI'
scenarios:
  - flow:
      - loop:
          - get:
              url: '/api/products/list'
          - get:
              url: '/api/products/1'
        count: 200

  - flow:
      - loop:
          - get:
              url: '/api/carts/get'
        count: 200
  - flow:
      - loop:
          - get:
              url: '/api/wishlists'
        count: 200
  - flow:
      - loop:
          - get:
              url: '/api/address'
          - get:
              url: '/api/address/1'
        count: 200