asciiart-load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    apdex: {}
    ensure: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
  defaults:
    headers:
      Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MjEsInJvbGUiOiJhZG1pbiIsImlhdCI6MTcyNDYwMTQ1NSwiZXhwIjoxNzI1MjA2MjU1fQ.ygNOYv9Rxe5TUmPxLPDT8CNqWgNlJ669wt1B_dPz_TI'
scenarios:
  - flow:
      - loop:
          - get:
              url: '/api/products/list'
          - get:
              url: '/api/products/1'
          - post:
              url: '/api/products/create'
              json:
                name: "Sample Product"
                price: 100
                description: "A sample product description"
          - patch:
              url: '/api/products/1'
              json:
                name: "Updated Product Name"
                price: 150
  - flow:
      - loop:
          - get:
              url: '/api/carts/get'
          - patch:
              url: '/api/carts/clear'
          - post:
              url: '/api/carts/product/set'
              json:
                productId: 1
                quantity: 2
          - delete:
              url: '/api/carts/product/delete/1'
        count: 10
  - flow:
      - loop:
          - get:
              url: '/api/wishlists'
          - patch:
              url: '/api/wishlists'
              json:
                productId: 1
                action: 'add'
          - delete:
              url: '/api/wishlists'
        count: 10
  - flow:
      - loop:
          - get:
              url: '/api/address'
          - post:
              url: '/api/address'
              json:
                state: "Test State"
                city: "Test City"
                street: "Test Street"
                firstName: "John"
                lastName: "Doe"
                email: "john.doe@example.com"
                mobileNumber: "1234567890"
          - get:
              url: '/api/address/1'
          - patch:
              url: '/api/address/1'
              json:
                city: "Updated City"
          - delete:
              url: '/api/address/1'
        count: 10
  - flow:
      - loop:
          - post:
              url: '/api/comments'
              json:
                productId: 1
                text: "Great product!"
          - patch:
              url: '/api/comments/1'
              json:
                text: "Updated comment text"
          - delete:
              url: '/api/comments/1'
        count: 10